#include <iostream>
using namespace std;
int main() {
	setlocale(LC_ALL, "Russian");
	cout << "Введите x" << endl;
	float  x, y;
	cin >> x;
	cout << "Введите у" << endl;
	cin >> y;
	if (-3 * x + 3 * y == 0) 
		{ cout << "Точка лежит на прямой" << endl; }
	if (((x + 3) * (x + 3)) + ((y + 3) * (y + 3)) == 9) 
		{ cout << "Точка лежит на окружности" << endl; }
	if (y == (-(x + 2) * (x + 2)) + 2) 
		{ cout << "Точка лежит на параболе" << endl; }
	if (y == 0) 
		{ cout << "Точка лежит на оси Ох" << endl; }
	if (x == 0) 
		{ cout << "Точка лежит на оси Оу" << endl; }
	if (x < 0 && y > 0 && y > (-(x + 2) * (x + 2)) + 2) 
		{ cout << "Точка принадлежит области 1" << endl; }
	if (x < 0 && y>0 && y < (-(x + 2) * (x + 2)) + 2) 
		{ cout << "Точка принадлежит области 2" << endl; }
	if (x < -2 && ((x + 3) * (x + 3)) + ((y + 3) * (y + 3)) > 9 &&  y>x) 
		{ cout << "Точка принадлежит области 3" << endl; }
	if(((x+3)*(x+3))+((y+3)*(y+3))<9&&y>(-(x+2)*(x+2))+2&&y>x)
		{ cout << "Точка принадлежит области 4" << endl; }
	if(((x + 3) * (x + 3)) + ((y + 3) * (y + 3)) < 9&& y < (-(x + 2) * (x + 2)) + 2&&y>x) 
		{ cout << "Точка принадлежит области 5" << endl; }
	if(x<0&& y < (-(x + 2) * (x + 2)) + 2&& ((x + 3) * (x + 3)) + ((y + 3) * (y + 3)) > 9&&y>x) 
		{ cout << "Точка принадлежит области 6" << endl; }
	if(x>-2&&x<0&& y > (-(x + 2) * (x + 2)) + 2&&y>x) 
		{ cout << "Точка принадлежит области 7" << endl; }
	if (y<0&&y<x&& y > (-(x + 2) * (x + 2)) + 2&&x>-2&&x<0) 
		{ cout << "Точка принадлежит области 8" << endl; }
	if(y<x&& y < (-(x + 2) * (x + 2)) + 2&&y<0&& ((x + 3) * (x + 3)) + ((y + 3) * (y + 3)) > 9&&y>-3&&y<0) 
		{ cout << "Точка принадлежит области 9" << endl; }
	if(((x + 3) * (x + 3)) + ((y + 3) * (y + 3)) < 9&&y<x&& y < (-(x + 2) * (x + 2)) + 2) 
		{ cout << "Точка принадлежит области 10" << endl; }
	if(y<x&& y > (-(x + 2) * (x + 2)) + 2&&x<-2&& ((x + 3) * (x + 3)) + ((y + 3) * (y + 3)) > 9) 
		{ cout << "Точка принадлежит области 11" << endl; }
	if(y<x&& y>(-(x + 2) * (x + 2)) + 2&& ((x + 3) * (x + 3)) + ((y + 3) * (y + 3)) < 9) 
		{ cout << "Точка принадлежит области 12" << endl; }
	if(y<0&& ((x + 3) * (x + 3)) + ((y + 3) * (y + 3)) > 9&& y < (-(x + 2) * (x + 2))&&y<-3&&x<0) 
		{ cout << "Точка принадлежит области 13" << endl;}
	if(y>0&&y>x) 
		{ cout << "Точка принадлежит области 14" << endl; }
	if(x>0&&y<x&& y>(-(x + 2) * (x + 2)) + 2&&y>0) 
		{ cout << "Точка принадлежит области 15" << endl; }
	if(y<0&& y<(-(x + 2) * (x + 2)) + 2&&x>0) 
		{ cout << "Точка принадлежит области 16" << endl; }
	if(x>0&&y<0&& y>(-(x + 2) * (x + 2)) + 2) 
		{ cout << "Точка принадлежит области 17" << endl; }
	system("pause");
	return 0;
}