#include <iostream>
using namespace std;
int main() {
	setlocale(LC_ALL, "Russian");
	int x1, x2, y1, y2, x11, x21, y11, y21;
	double x, y, D;
	cout << "Введите координаты первой точки первой прямой" << endl;
	cin >> x1 >> y1;
	cout << "Введите координаты второй точки первой прямой" << endl;
	cin >> x2 >> y2;
	cout << "Введите координаты первой точки второй прямой" << endl;
	cin >> x11 >> y11;
	cout << "Введите координаты второй точки второй прямой" << endl;
	cin >> x21 >> y21;
	D = (y1 - y2) * (x21 - x11) - (x2 - x1) * (y11 - y21);
	x = ((((x2 * y1) - (x1 * y2)) * (x21 - x11)) - ((x2 - x1) * ((x21 * y11) - (x11 * y21)))) / D;
	y = (((y1 - y2) * ((x21 * y11) - (x11 * y21))) - (((x2 * y1) - (x1 * y2)) * (y11 - y21))) / D; //решение системы методом определителей
	if ((((y1 - y2) * x) + ((x2 - x1) * y)) + (-(x2 * y1) + (x1 * y2)) == 0 && (((y11 - y21) * x) + ((x21 - x11) * y)) + (-(x21 * y11) + (x11 * y21)) == 0) {
		cout << "Координаты точки пересечения прямых (" << x << ";" << y << ")" << endl;

	}
	else cout << "Ошибка:прямые параллельны или прямые совпадают" << endl;

	
	

	system("pause");
	return 0;

}
